gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TxDATA.c


#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/TASK.h"
#include "../DL698/RM_TASK.h"
#include "../DL698/RM_TxDATA.h"
#include "../DL698/RM_RxDATA.h"
#include "../DL698/RM_Record.h"

#include "../Device/MEMRW.h"
#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../STM32F4xx/STM32F4xx_DMA.h"
#include "../DL698/DL698_Uart.h"
#include "../Calculate/Calculate.h"
#include "../Display/Warning.h"
#include "../MS/msFILE.h"
#include "../MS/MS.h"


#include "../DL698/DL698_JSON.h"



u32 RM_TxDATA(u32 PORTn,u8 *p8CSD,u8 *p8tx)//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数
{
	UARTCtrl_TypeDef * UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
	{
		case 1://DL/T645-1997
			return RM_TxDATA_DL1997(PORTn,p8CSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数
		case 2://DL/T645-2007
			return RM_TxDATA_DL2007(PORTn,p8CSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数
		case 3://DL/T698.45
			return RM_TxDATA_DL698(PORTn,p8CSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数
		case 4://CJ/T 188-2004
			return 0;//RM_TxDATA_CJ188(PORTn,p8CSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数
		case ProtocolNO_ABB://ABB
			return RM_TxDATA_ABB(PORTn,p8CSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数
		case ProtocolNO_Landis://Landis(IEC1107 模式C)
			return RM_TxDATA_Landis(PORTn,p8CSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数
		default://未知 (0)
			return 0;//返回:组帧后总长度字节数

	}
}

u32 RM_TxDATA_Manage(u32 PORTn)//抄表发送数据帧管理;返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
{
	u32 i;
	u32 x;
	u32 y;
	u8* p8tx;
	u8* p8rx;
	u16* p16;
	u8* pCSD;
	UARTCtrl_TypeDef * UARTCtrl;
	RecordFileHead_TypeDef* RecordFileHead;
	u32 FileID;
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	u32 Addr0;
	u32 Addr1;
	u32 Addr2;
	u8* p8;
	u16* p16timer;
#if RMSOMETASK==1//0=否,1=是;同类抄表任务归为同个任务抄表,不重启路由
	u32 n;
	u32 NUM_SomeTaskID;
#endif
	u32 SetNo;
	
	SetNo=SetNo;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
//	p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);

	UARTCtrl->Task=0;//空闲1次
	UARTCtrl->TxByte=0;
	
	i=UARTCtrl->TaskID;
	i>>=8;
	i&=0xff;//任务号
	SetNo=UARTCtrl->MeterCount[i];

	switch(UARTCtrl->CONNECT)//DL698连接:0=空,1=启动连接,2=，100=连接,101=抄表中,102=关闭连接
	{
		default://698规约连接和关闭过程
			UARTCtrl->CONNECT=0;
			return 4;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
		case 1://连接过程1
		case 2://连接过程2
			switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
			{
				default:
				case 1://DL/T645-1997
				case 2://DL/T645-2007
					UARTCtrl->CONNECT=100;
					return 4;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case 3://DL/T698.45
					UARTCtrl->CONNECT=100;
					return 4;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case 4://CJ/T 188-2004
					UARTCtrl->CONNECT=100;
					return 4;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case ProtocolNO_ABB://ABB
					x=RM_TxDATA(PORTn,pCSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
					if(x)
					{
						UARTCtrl->TxByte=x;//发送字节数
						return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
					}
					return 0;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case ProtocolNO_Landis://Landis(IEC1107 模式C)
					x=RM_TxDATA(PORTn,pCSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
					if(x)
					{
						UARTCtrl->TxByte=x;//发送字节数
						return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
					}
					return 0;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
			}
		case 0://0=空
			i=UARTCtrl->TaskID;
			if(i==0)
			{
				if(PORTn!=ACSAMPLEPORT)
				{//不是交采
					RM_NUM_Display(PORTn);//抄表数量显示
					if(PORTn==RS485_4PORT)
					{
						WarningOccur(PORTn,(u8 *)"载波 当前任务完成");//告警发生,入口告警代码和告警字符串
					}
				}
		#if DEBUG==1//0=发行,1=调试
				else
				{//是交采
					RM_NUM_Display(PORTn);//抄表数量显示
				}
		#endif
				return 4;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
			}
			i>>=8;
			i&=0xff;
			if(i>=(RMTASKmax+ExtRMTASKmax))
			{
				return 4;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
			}
			if(PORTn==RS485_4PORT)
			{//载波
				RM_NUM_Display(PORTn);//抄表数量显示
			}
			for(x=0;x<100;x++)
			{
			#if RMSOMETASK==1//0=否,1=是;同类抄表任务归为同个任务抄表,不重启路由
				if(UARTCtrl->RMMeterCountAuto==1)//抄表电能表自动加1计数,0=自动,1=不自动(路由模块主动)
				{
					if(SetNo>=NUM_RMmax)
					{//错
						return 3;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
					}
					NUM_SomeTaskID=UARTCtrl->NUM_SomeTaskID;//当前同类采集任务的id号的列表个数
					n=0;
					y=0;
					for(n=0;n<NUM_SomeTaskID;n++)
					{
						y=UARTCtrl->TaskID;
						y&=0xffff0000;
						y|=UARTCtrl->SomeTaskid[n];//RMTASKmax*2 byte 当前同类采集任务的b15-b8任务号,b7-b0方案编号
						UARTCtrl->TaskID=y;
						y>>=8;
						y&=0xff;//任务号
						if(y>=(RMTASKmax+ExtRMTASKmax))
						{
							continue;
						}
						UARTCtrl->MeterCount[y]=SetNo;//2*RMTASKmax byte各任务已抄电能表计数,主动上报时用于文件中已上报电能表计数
						y=RM_Meter(PORTn);//当前电能表计数是否要抄;入口:UARTCtrl->MeterCount[],UARTCtrl->TaskID;返回:0=不抄,1=要抄,2=完成,同时填写通信地址,波特率,抄表规约类型,
						if(y)
						{
							break;
						}
					}
				}
				else
				{
					y=RM_Meter(PORTn);//当前电能表计数是否要抄;入口:UARTCtrl->MeterCount[],UARTCtrl->TaskID;返回:0=不抄,1=要抄,2=完成,同时填写通信地址,波特率,抄表规约类型,
				}
			#else//#if RMSOMETASK==1//0=否,1=是;同类抄表任务归为同个任务抄表,不重启路由
				y=RM_Meter(PORTn);//当前电能表计数是否要抄;入口:UARTCtrl->MeterCount[],UARTCtrl->TaskID;返回:0=不抄,1=要抄,2=完成,同时填写通信地址,波特率,抄表规约类型,
			#endif
				if(y==1)
				{//要抄
					i=UARTCtrl->TaskID;//TaskID=b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
					if(((i>>20)&0xf)==4)
					{//4=RetryMetering 补抄
						if(((i>>24)&0xf)==1)
						{//普通采集方案
							i=UARTCtrl->RMprotocol;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
							if(((i!=2)&&(i!=3))||(PORTn==ACSAMPLEPORT))//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
							{//不补抄除645-2007和DL698.45外的表;也不补抄交采
								RM_OK_FAIL(PORTn,1);//抄表成功失败地址记录:入口:OK=0失败，=1成功,2=成功但数据为空
								y=0;//0=不抄
							}
						}
					}
				}
				if(y==1)
				{//要抄
					break;
				}
			#if ((Project/100)==2)||((Project/100)==4)//方案0=智能表,100=网络表,200=集中器,300=专变终端,400=公变终端,500=集中器Ⅱ型,600=通信模块,700=
				if(PORTn==RS485_4PORT)
				{//载波口
					if(UARTCtrl->RMMeterCountAuto!=0)//抄表电能表自动加1计数,0=自动,1=不自动(路由模块主动)
					{//路由主导的周期抄表模式
						if(y==2)
						{
							return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
						}
						return 0;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
					}
				}
			#endif
				y=0;
				if(UARTCtrl->RMMeterCountAuto!=0)//抄表电能表自动加1计数,0=自动,1=不自动(路由模块主动)
				{
					break;
				}
				i=RM_MeterCount(PORTn);//电能表计数+1;返回:0=正常,1=任务错
				if(i)
				{
					return 0;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				}
			}
			if(y==0)
			{
				return 0;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
			}
			
