gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TxDATA.c
			UARTCtrl->CONNECT=1;//DL698连接:0=空,1=启动连接，2=，100=连接,101=抄表中
			UARTCtrl->ReRMCount=0;//抄表重发计数
		#if(USER/100)==17//江苏系
			if((((UARTCtrl->TaskID>>20)&0xf)==5)&&(Terminal_Router->MinuteCollect==1))
			//if(((UARTCtrl->TaskID>>20)&0xf)==5)
				UARTCtrl->RMprotocol=3;
		#endif
			switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
			{
				case 1://DL/T645-1997
				case 2://DL/T645-2007
				case 3://DL/T698.45
					break;
				case 4://CJ/T 188-2004
					break;
				case ProtocolNO_ABB://ABB
					x=RM_TxDATA(PORTn,pCSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
					if(x)
					{
						UARTCtrl->TxByte=x;//发送字节数
					}
					return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case ProtocolNO_Landis://Landis(IEC1107 模式C)
					x=RM_TxDATA(PORTn,pCSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
					if(x)
					{
						UARTCtrl->TxByte=x;//发送字节数
					}
					return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
			}
		case 100://100=连接
			UARTCtrl->CONNECT=101;//DL698连接:0=空,1=启动连接，2=，100=连接,101=抄表中
			UARTCtrl->RM_SubsequentFrames=0;//0=无读后续帧,1-n=读续帧的帧号
			UARTCtrl->RMCSDCount=0;//抄表CSD计数
			UARTCtrl->RMCSDSubCount=0;//抄表CSD子计数
			UARTCtrl->RMROADCount=0;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
			UARTCtrl->RMROADCountOK=0;//抄表数据缓冲ROAD时已填入关联的OAD数据个数计数
			UARTCtrl->ReRMCount=0;//抄表重发计数
			UARTCtrl->RM_OKFAIL=0;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
			UARTCtrl->RM_DI_TI_Count=0;//按时标间隔采集时的间隔计数
			UARTCtrl->RM_Rx_date_40020200[0]=0;//抄表接收到的数据用于MAC验证的电能表表号;0th=状态(0=空,1=正在抄,2=完成),1th=表号长度(<=6),2th-7th表号值
			RM_RxDATA_START(PORTn);//抄表接收数据处理-开始
			break;
		case 101://101=抄表中
			i=i;
			break;
		case 102://102=关闭连接
			switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
			{
				default:
				case 1://DL/T645-1997
				case 2://DL/T645-2007
					//下电能表
					RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
					return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case 3://DL/T698.45
					//下电能表
					RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
					return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case 4://CJ/T 188-2004
					//下电能表
					RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
					return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case ProtocolNO_ABB://ABB
					x=RM_TxDATA(PORTn,pCSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
					if(x)
					{
						UARTCtrl->TxByte=x;//发送字节数
					}
					return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
				case ProtocolNO_Landis://Landis(IEC1107 模式C)
					x=RM_TxDATA(PORTn,pCSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
					if(x)
					{
						UARTCtrl->TxByte=x;//发送字节数
					}
					return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
			}
	}
	
#if RMSOMETASK==1//0=否,1=是;同类抄表任务归为同个任务抄表,不重启路由
	if(UARTCtrl->RMMeterCountAuto==1)//抄表电能表自动加1计数,0=自动,1=不自动(路由模块主动)
	{
		NUM_SomeTaskID=UARTCtrl->NUM_SomeTaskID;//当前同类采集任务的id号的列表个数
		n=0;
		y=0;
		for(n=0;n<NUM_SomeTaskID;n++)
		{
			y=UARTCtrl->TaskID;
			y&=0xffff0000;
			y|=UARTCtrl->SomeTaskid[n];//RMTASKmax*2 byte 当前同类采集任务的b15-b8任务号,b7-b0方案编号
			UARTCtrl->TaskID=y;
			y>>=8;
			y&=0xff;//任务号
			if(y>=(RMTASKmax+ExtRMTASKmax))
			{
				continue;
			}
			UARTCtrl->MeterCount[y]=SetNo;//2*RMTASKmax byte各任务已抄电能表计数,主动上报时用于文件中已上报电能表计数
			y=RM_Meter(PORTn);//当前电能表计数是否要抄;入口:UARTCtrl->MeterCount[],UARTCtrl->TaskID;返回:0=不抄,1=要抄,2=完成,同时填写通信地址,波特率,抄表规约类型,
			if(y)
			{
				break;
			}
		}
		if(y==0)
		{//没找到
			return 3;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
		}
	}
#endif
	while(1)
	{
		pCSD=RM_CSD(PORTn);//取抄表数据标识CSD;返回:0=无效,1=CSD在URATCtrl,其他值=透明抄读帧数据指针
		if(pCSD!=0)
		{//有效
			if((u32)pCSD==1)
			{//普通采集方案,事件采集方案
				pCSD=(u8*)&UARTCtrl->RMCSD;//1=CSD在URATCtrl
				switch((UARTCtrl->TaskID>>20)&0xf)//采集类型
				{
					default:
						break;
					case 0://0=采集当前数据
					case 1://1=采集上第N次
					case 2://2=按冻结时标采集
					case 3://3=按时标间隔采集
						i=(UARTCtrl->RMCSD[2]<<8)|(UARTCtrl->RMCSD[3]<<0);//采集数据的OI
						switch(i)
						{//
							case 0x5002://分钟冻结
								//采曲线数据,按任务执行间隔时间和采集方案采集间隔时间计算
								DateSaveTI(PORTn,UARTCtrl->date_time_s);//普通采集方案的采集存储时标;返回:pOUT=date_time_s
								FileID=Get_FileID(PORTn);//UART各任务的FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0保留
								//FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类,相应域值为0xFF表示不关注
								Comm_Ram->msFILESearchCount=0;
								filename=Get_RecordFileName(FileID,0xffffffff,UARTCtrl->date_time_s);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFFFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
								if(filename!=0xffffffff)
								{//找到
									if(filename<FILENAMEmax_FLASH)
									{
										file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
									}
									else
									{
										file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
									}
									y=file->NUM_DATA;//文件存入数据个数计数(同抄表成功个数)
									if(y>NUM_RMmax)
									{
										y=NUM_RMmax;
									}
									ms=Get_ms();
									ms->msfile_read(filename,0,(u8*)ADDR_AddrList,y*sizeof(RecordFileHead_TypeDef));
									RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
									Addr0=UARTCtrl->RMAddr[0];
									Addr1=UARTCtrl->RMAddr[1];
									Addr2=UARTCtrl->RMAddr[2];
									for(i=0;i<y;i++)
									{
										if(RecordFileHead->Addr0==Addr0)
										{
											if(RecordFileHead->Addr1==Addr1)
											{
												if(RecordFileHead->Addr2==Addr2)
												{
													pCSD=0;//已抄
													x=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
													x&=0xf0;
													x|=1;
													UARTCtrl->RM_OKFAIL=x;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
													break;
												}
											}
										}
										RecordFileHead++;
									}
								}
								break;
							default:
								break;
						}
						break;
					case 4://4=RetryMetering 补抄(类同,2=按冻结时标采集)
						i=(UARTCtrl->RMCSD[2]<<8)|(UARTCtrl->RMCSD[3]<<0);//采集数据的OI
						switch(i)
						{//
							case 0x5002://分钟冻结
							case 0x5004://日冻结
								DateSaveTI(PORTn,UARTCtrl->date_time_s);//普通采集方案的采集存储时标;返回:pOUT=date_time_s
								FileID=Get_FileID(PORTn);//UART各任务的FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0保留
								//FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0文件分类,相应域值为0xFF表示不关注
								Comm_Ram->msFILESearchCount=0;
								filename=Get_RecordFileName(FileID,0xffffffff,UARTCtrl->date_time_s);//搜索文件名:入口:FileID=b31-b28方案类型,b27-b24采集类型,b23-b20存储时标类型,b19-b12任务号,b11-b8端口号,b7-b0,相应域值为0xF表示不关注,pTime数据存储时标=0表示不关注;SearchCount=开始搜索的文件号0xFFFFFFFF表示从上次结束号开始搜索;返回:0--(FILENAMEmax_FLASH-1)表示文件在FLASH,FILENAMEmax_FLASH--(FILENAMEmax_RAM-1)表示文件在RAM,0xffffffff表示没找到
								if(filename!=0xffffffff)
								{//找到
									if(filename<FILENAMEmax_FLASH)
									{
										file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
									}
									else
									{
										file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-FILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
									}
									y=file->NUM_DATA;//文件存入数据个数计数(同抄表成功个数)
									if(y>NUM_RMmax)
									{
										y=NUM_RMmax;
									}
									ms=Get_ms();
									ms->msfile_read(filename,0,(u8*)ADDR_AddrList,y*sizeof(RecordFileHead_TypeDef));
									RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_AddrList);
									Addr0=UARTCtrl->RMAddr[0];
									Addr1=UARTCtrl->RMAddr[1];
									Addr2=UARTCtrl->RMAddr[2];
									for(i=0;i<y;i++)
									{
										if(RecordFileHead->Addr0==Addr0)
										{
											if(RecordFileHead->Addr1==Addr1)
											{
												if(RecordFileHead->Addr2==Addr2)
												{
													pCSD=0;//已抄
													x=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
													x&=0xf0;
													x|=1;
													UARTCtrl->RM_OKFAIL=x;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
													break;
												}
											}
										}
										RecordFileHead++;
									}
								}
								break;
							default:
								pCSD=0;//已抄
								break;
						}
						break;
				}
			//帧数据
				if(pCSD!=0)
				{
				//交采
					if(PORTn==ACSAMPLEPORT)
					{//交采
						p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
						x=RM_TxDATA(PORTn,pCSD,p8rx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数						
						if(x)
						{
							p8rx[1]=0xaa;
							p8rx[2]=0xaa;
							p8rx[3]=0xaa;
							p8rx[4]=0xaa;
							p8rx[5]=0xaa;
							p8rx[6]=0xaa;
							UARTCtrl->TxByte=x;//发送字节数
							#ifdef DEBUG_JSON
							for(i=0;i<x;i++)
								myprintf("%02x ",p8rx[i],0,0);
							myprintf("\n",0,0,0);
							#endif
							return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
						}
					}
				//RS485
					if((PORTn==RS485_1PORT)||(PORTn==RS485_2PORT))
					{//RS485
						switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
						{
							case 1://DL/T645-1997
							case 2://DL/T645-2007
							case 3://DL/T698.45
								x=RM_TxDATA(PORTn,pCSD,p8tx+4);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
								if(x)
								{
									p8tx[0]=0xfe;
									p8tx[1]=0xfe;
									p8tx[2]=0xfe;
									p8tx[3]=0xfe;
									x+=4;
									UARTCtrl->TxByte=x;//发送字节数
									#ifdef DEBUG_JSON
									for(i=0;i<x;i++)
										myprintf("%02x ",p8tx[i],0,0);
									myprintf("\n",0,0,0);
									#endif
									return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
								}
								break;
							default:
								x=RM_TxDATA(PORTn,pCSD,p8tx);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
								if(x)
								{
									UARTCtrl->TxByte=x;//发送字节数
									return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
								}
								break;
						}
					}
				//载波
					if(PORTn==RS485_4PORT)
					{//载波
						switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
						{
							case 1://DL/T645-1997
							case 2://DL/T645-2007
							case 3://DL/T698.45
								if(Comm_Ram->RouterType==10)//路由器类型:0=保留,1=正泰,2=鼎信,3=东软,4=晓晨,5=瑞斯康,6=力合微,7=讯能,8=钱龙,9=华瑞,10=新开普
								{//新开普强制集中器主动抄表,同时不加0xfe
									x=RM_TxDATA(PORTn,pCSD,p8tx+128);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
									if(x)
									{
										UARTCtrl->TxByte=x;//发送字节数
										return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
									}
									break;
								}
								x=RM_TxDATA(PORTn,pCSD,p8tx+128+4);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
								//myprintf("[%s:%d]:载波组帧完成字节数%d\n",(u32)&__func__,(u32)__LINE__,x);
								if(x)
								{//发送字节数
									p8tx[128]=0xfe;
									p8tx[129]=0xfe;
									p8tx[130]=0xfe;
									p8tx[131]=0xfe;
									x+=4;
									UARTCtrl->TxByte=x;//发送字节数
									//for(x=0;x<UARTCtrl->TxByte;x++)
										//myprintf("%02x ",p8tx[x],0,0);
									//myprintf("\n",0,0,0);
									return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
								}
								break;
							default:
								x=RM_TxDATA(PORTn,pCSD,p8tx+128);//抄表发送帧;入口:p8CSD=需发送的CSD指针,p8tx=发送缓冲指针;返回:组帧后总长度字节数 
								if(x)
								{
									UARTCtrl->TxByte=x;//发送字节数
									return 2;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
								}
								break;
						}
					}
				}
			}
			else
			{//透明方案
				
				
				
