gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TxDATA.c
			}
		}
		i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
		i++;
		UARTCtrl->RMCSDSubCount=i;
		x=UARTCtrl->RMCSDSubCountMax;
		if(i>=x)
		{
			//1个完整的CSD的数据
			i=RM_One_CSD(PORTn);//检查抄表是否完成1个完整的CSD的数据;返回:错误代码0=正确,1=缓冲1长度不够,2=缓冲2长度不够,3=缓冲中有关长度值错,4=无对应接口类号,5=数组数大于127
			if(i)
			{
				switch(i)
				{
					case 1:
						i=CopyString((u8 *)"缓冲1长度不够",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						break;
					case 2:
						i=CopyString((u8 *)"缓冲2长度不够",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						break;
					case 3:
						i=CopyString((u8 *)"缓冲中有关长度值错",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						break;
					case 4:
						i=CopyString((u8 *)"无对应接口类号",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						break;
					case 5:
						i=CopyString((u8 *)"数组数大于127",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						break;
					case 6:
						i=CopyString((u8 *)"抄表计数大于最大数",(u8*)ADDR_DATABUFF);//拷贝字符串;返回拷贝字符串字节数(不计结束0)
						break;
				}
				p8=(u8*)ADDR_DATABUFF;
				p8[i]=0;
				WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//告警发生,入口告警代码和告警字符串
				p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
				p16timer[0]=1000/10;//下帧启动发送延时,以显示错误码
			}
			
			UARTCtrl->RMCSDSubCount=0;//抄表CSD子计数
			i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数
			i++;
			UARTCtrl->RMROADCount=i;
			x=UARTCtrl->RMROADCountMax;
			if(i>=x)
			{
				UARTCtrl->RMROADCount=0;//抄表CSD的ROAD内OAD计数
				UARTCtrl->RMROADCountOK=0;//抄表数据缓冲ROAD时已填入关联的OAD数据个数计数
				i=UARTCtrl->RMCSDCount;//抄表CSD计数
				i++;
				UARTCtrl->RMCSDCount=i;
				x=UARTCtrl->RMCSDCountMax;
				if(i>=x)
				{//本表抄表完成
					RecordFileHead=(RecordFileHead_TypeDef*)Get_ADDR_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲地址
					p16=(u16 *)Get_ADDR_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲地址
					p16+=(LEN_RM_DI_CSD)/2;//已填写入buff完整CSD的长度
					i=p16[1];
					#if(USER/100)==17
					i=(UARTCtrl->TaskID>>20)&0xf;
					if(i==4||i==3)//补抄//按采集时标采集的分钟曲线
					{
						i=1;
					}else
					{
						i=p16[1];
					}
					#endif
					if(i)
					{//有数据填入
						//写记录
						RM_RxDATA_END(PORTn);//抄表接收数据处理-结束
						RM_RecordFile(PORTn,(u8*)RecordFileHead);//抄表记录
						//清抄表成功判断数据
						p16[1]=0;
						x=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
						x&=0xf0;
						x|=1;
						UARTCtrl->RM_OKFAIL=x;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
					}
					else
					{//无数据填入
						//清抄表成功判断数据
						p16[1]=0;
						x=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
						if((x&0xf)==0)//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
						{
							x|=2;
							UARTCtrl->RM_OKFAIL=x;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
						}
					}
					switch((UARTCtrl->TaskID>>20)&0xf)//采集类型
					{
						default:
						case 0://0=采集当前数据
						case 1://1=采集上第N次
						case 2://2=按冻结时标采集
						case 3://3=按时标间隔采集
							i=(UARTCtrl->RMCSD[2]<<8)|(UARTCtrl->RMCSD[3]<<0);//采集数据的OI
							switch(i)
							{
								case 0x5002://分钟冻结(采曲线数据)
									i=UARTCtrl->TaskID;
									i>>=20;
									i&=0xf;
									switch(i)//普通采集方案的采集类型
									{
										default:
										case 0://采集当前数据,
										case 1://采集上第N次,
										case 2://按冻结时标采集,
											break;
										case 3://按时标间隔采集(曲线)
											UARTCtrl->RM_DI_TI_Count++;//按时标间隔采集时的间隔计数
											//按任务执行间隔时间和采集方案采集间隔时间计算
											i=UARTCtrl->TaskID;
											i>>=8;
											i&=0xff;//任务号
											//任务执行间隔时间
											x=ADDR_6012_2_SDRAM+(i*LENper_6012_2);
											i=pTItoSECOND((u8*)x+5);//TI转为秒值,出口:hex秒
											if(PORTn==RS485_4PORT)
											{//是载波口
											#if (CurveTaskTImax)
												if(i<CurveTaskTImax)//(24*60*60)//曲线抄表任务执行频率最大值(秒),此值决定按采集方案采集间隔时间可向前补抄的曲线点数
												{
													i=CurveTaskTImax;
												}
											#endif
											}
											//采集方案采集间隔时间
											x=pTItoSECOND(UARTCtrl->RM_DI_TI);//TI转为秒值,入口:pTI无数据类型;出口:hex秒
											//#if (USER/100)==17
											//if(UARTCtrl->RM_DI_TI_Count>0)
											//{
												//x*=(UARTCtrl->RM_DI_TI_Count-1);
											//}
											//#else
											//x*=UARTCtrl->RM_DI_TI_Count;
											//#endif
											x*=UARTCtrl->RM_DI_TI_Count;
											if(x<i)
											{
												UARTCtrl->RM_SubsequentFrames=0;//0=无读后续帧,1-n=读续帧的帧号
												UARTCtrl->RMCSDCount=0;//抄表CSD计数
												UARTCtrl->RMCSDSubCount=0;//抄表CSD子计数
												UARTCtrl->RMROADCount=0;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
												UARTCtrl->RMROADCountOK=0;//抄表数据缓冲ROAD时已填入关联的OAD数据个数计数
												UARTCtrl->ReRMCount=0;//抄表重发计数
												x=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
												if((x>>4)!=2)
												{
													if((x&0xf)==2)
													{
														x=0x20;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
													}
												}
												x&=0xf0;
												UARTCtrl->RM_OKFAIL=x;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
												RM_RxDATA_START(PORTn);//抄表接收数据处理-开始
												continue;
											}
											//按采集间隔的点数抄完
											x=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
											x>>=4;
											if(x!=2)
											{
												x=1;
											}
											UARTCtrl->RM_OKFAIL=x;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
											break;
										case 4://RetryMetering 补抄
											break;
									}
									break;
								//========国网台体改动==========
								case 0x5006://月冻结
								case 0x5004://日冻结
									UARTCtrl->RM_SubsequentFrames=0;//0=无读后续帧,1-n=读续帧的帧号
									UARTCtrl->RMCSDCount=0;//抄表CSD计数
									UARTCtrl->RMCSDSubCount=0;//抄表CSD子计数
									UARTCtrl->RMROADCount=0;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
									UARTCtrl->RMROADCountOK=0;//抄表数据缓冲ROAD时已填入关联的OAD数据个数计数
									UARTCtrl->ReRMCount=0;//抄表重发计数
									break;
								default:
									break;
							}
							break;
						case 4://4=RetryMetering 补抄(类同,2=按冻结时标采集)
							switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
							{
								default:
									break;
								case 2://DL/T645-2007
								case 3://DL/T698.45
									UARTCtrl->RM_DI_TI_Count++;//按时标间隔采集时的间隔计数
									//#if(USER/100)==17
									//if((UARTCtrl->RM_DI_TI_Count-1)<UARTCtrl->RM_DI_N)
									//#else
									//if(UARTCtrl->RM_DI_TI_Count<UARTCtrl->RM_DI_N)
									//#endif
									if(UARTCtrl->RM_DI_TI_Count<UARTCtrl->RM_DI_N)
									{
										UARTCtrl->RM_SubsequentFrames=0;//0=无读后续帧,1-n=读续帧的帧号
										UARTCtrl->RMCSDCount=0;//抄表CSD计数
										UARTCtrl->RMCSDSubCount=0;//抄表CSD子计数
										UARTCtrl->RMROADCount=0;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
										UARTCtrl->RMROADCountOK=0;//抄表数据缓冲ROAD时已填入关联的OAD数据个数计数
										UARTCtrl->ReRMCount=0;//抄表重发计数
										x=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
										if((x>>4)!=2)
										{
											if((x&0xf)==2)
											{
												x=0x20;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
											}
										}
										x&=0xf0;
										UARTCtrl->RM_OKFAIL=x;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
										RM_RxDATA_START(PORTn);//抄表接收数据处理-开始
										continue;
									}
									//按采集的点数抄完
									x=UARTCtrl->RM_OKFAIL;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
									x>>=4;
									if(x!=2)
									{
										x=1;
									}
									UARTCtrl->RM_OKFAIL=x;//抄表成功失败标志;=0失败，=1成功,2=成功但无数据
									break;
							}
							break;
					}
					
					RM_OK_FAIL(PORTn,UARTCtrl->RM_OKFAIL);//抄表成功失败地址记录:入口:OK=0失败，=1成功,2=成功但无数据
					
					//发关闭连接帧
					switch(UARTCtrl->RMprotocol)//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
					{
						default:
						case 1://DL/T645-1997
						case 2://DL/T645-2007
							//下电能表
							RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
							return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
						case 3://DL/T698.45
							//下电能表
							RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
							return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
						case 4://CJ/T 188-2004
							//下电能表
							RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
							return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
						case ProtocolNO_ABB://ABB
							//下电能表
							RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
							return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
						case ProtocolNO_Landis://Landis
							//下电能表
							RM_MeterCount(PORTn);//电能表计数+1;返回:0=没抄完,1=抄完
							return 1;//返回:0=不需抄,1=已抄,2=正在抄,3=失败,4=任务暂停
					}
				
				}
			}
		}
	}
}











